RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_exmc.c
/*!
    \file    gd32h75e_exmc.c
    \brief   EXMC driver

    \version 2025-08-07, V1.2.0, firmware for GD32H75E
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include <stdlib.h>
#include "gd32h75e_exmc.h"

/* EXMC bank0 register reset value */
#define BANK0_SNCTL_RESET                 ((uint32_t)0x000030DAU)  /* SNCTL register reset value */
#define BANK0_SNTCFG_RESET                ((uint32_t)0x0FFFFFFFU)  /* SNTCFG register reset value */
#define BANK0_SNWTCFG_RESET               ((uint32_t)0x0FFFFFFFU)  /* SNWTCFG register reset value */

/* EXMC bank2 register reset value */
#define BANK2_NCTL_RESET                  ((uint32_t)0x00000008U)  /* NCTL register reset value */
#define BANK2_NINTEN_RESET                ((uint32_t)0x00000042U)  /* NINTEN register reset value */
#define BANK2_NCTCFG_RESET                ((uint32_t)0xFFFFFFFFU)  /* NCTCFG register reset value */
#define BANK2_NATCFG_RESET                ((uint32_t)0xFFFFFFFFU)  /* NATCFG register reset value */

/* EXMC SDRAM device register reset value */
#define SDRAM_DEVICE_SDCTL_RESET          ((uint32_t)0x000002D0U)  /* SDCTL register reset value */
#define SDRAM_DEVICE_SDTCFG_RESET         ((uint32_t)0x0FFFFFFFU)  /* SDTCFG register reset value */
#define SDRAM_DEVICE_SDCMD_RESET          ((uint32_t)0x00000000U)  /* SDCMD register reset value */
#define SDRAM_DEVICE_SDARI_RESET          ((uint32_t)0x00000000U)  /* SDARI register reset value */
#define SDRAM_DEVICE_SDSTAT_RESET         ((uint32_t)0x00000000U)  /* SDSTAT register reset value */
#define SDRAM_DEVICE_SDRSCTL_RESET        ((uint32_t)0x00000000U)  /* SDRSCTL register reset value */

/* EXMC register bit offset */
/* EXMC_SNCTL register bit offset */
#define SNCTL_NRMUX_OFFSET                ((uint32_t)0x00000001U)  /* bit offset of NRMUX */
#define SNCTL_NREN_OFFSET                 ((uint32_t)0x00000006U)  /* bit offset of NREN */
#define SNCTL_SBRSTEN_OFFSET              ((uint32_t)0x00000008U)  /* bit offset of SBRSTEN */
#define SNCTL_WREN_OFFSET                 ((uint32_t)0x0000000CU)  /* bit offset of WREN */
#define SNCTL_NRWTEN_OFFSET               ((uint32_t)0x0000000DU)  /* bit offset of NRWTEN */
#define SNCTL_EXMODEN_OFFSET              ((uint32_t)0x0000000EU)  /* bit offset of EXMODEN */
#define SNCTL_ASYNCWAITEN_OFFSET          ((uint32_t)0x0000000FU)  /* bit offset of ASYNCWAITEN */
#define SNCTL_BKREMAP_OFFSET              ((uint32_t)0x00000018U)  /* bit offset of BKREMAP */

/* EXMC_SNTCFG register bit offset */
#define SNTCFG_AHLD_OFFSET                ((uint32_t)0x00000004U)  /* bit offset of AHLD */
#define SNTCFG_DSET_OFFSET                ((uint32_t)0x00000008U)  /* bit offset of DSET */
#define SNTCFG_BUSLAT_OFFSET              ((uint32_t)0x00000010U)  /* bit offset of BUSLAT */

/* EXMC_NCTL register bit offset */
#define NCTL_NDWTEN_OFFSET                ((uint32_t)0x00000001U)  /* bit offset of NDWTEN */
#define NCTL_ECCEN_OFFSET                 ((uint32_t)0x00000006U)  /* bit offset of ECCEN */

/* EXMC_NCTCFG register bit offset */
#define NCTCFG_COMWAIT_OFFSET             ((uint32_t)0x00000008U)  /* bit offset of COMWAIT */
#define NCTCFG_COMHLD_OFFSET              ((uint32_t)0x00000010U)  /* bit offset of COMHLD */
#define NCTCFG_COMHIZ_OFFSET              ((uint32_t)0x00000018U)  /* bit offset of COMHIZ */

/* EXMC_NATCFG register bit offset */
#define NATCFG_ATTWAIT_OFFSET             ((uint32_t)0x00000008U)  /* bit offset of ATTWAIT */
#define NATCFG_ATTHLD_OFFSET              ((uint32_t)0x00000010U)  /* bit offset of ATTHLD */
#define NATCFG_ATTHIZ_OFFSET              ((uint32_t)0x00000018U)  /* bit offset of ATTHIZ */

/* EXMC_SDCTL register bit offset */
#define SDCTL_WPEN_OFFSET                 ((uint32_t)0x00000009U)  /* bit offset of WPEN */
#define SDCTL_BRSTRD_OFFSET               ((uint32_t)0x0000000CU)  /* bit offset of BRSTRD */

/* EXMC_SDTCFG register bit offset */
#define SDTCFG_XSRD_OFFSET                ((uint32_t)0x00000004U)  /* bit offset of XSRD */
#define SDTCFG_RASD_OFFSET                ((uint32_t)0x00000008U)  /* bit offset of RASD */
#define SDTCFG_ARFD_OFFSET                ((uint32_t)0x0000000CU)  /* bit offset of ARFD */
#define SDTCFG_WRD_OFFSET                 ((uint32_t)0x00000010U)  /* bit offset of WRD */
#define SDTCFG_RPD_OFFSET                 ((uint32_t)0x00000014U)  /* bit offset of RPD */
#define SDTCFG_RCD_OFFSET                 ((uint32_t)0x00000018U)  /* bit offset of RCD */

/* EXMC_SDCMD register bit offset */
#define SDCMD_NARF_OFFSET                 ((uint32_t)0x00000005U)  /* bit offset of NARF */
#define SDCMD_MRC_OFFSET                  ((uint32_t)0x00000009U)  /* bit offset of MRC */

/* EXMC_SDCMD register bit offset */
#define SDARI_ARINTV_OFFSET               ((uint32_t)0x00000001U)  /* bit offset of ARINTV */

/* EXMC_SDRSCTL register bit offset */
#define SDRSCTL_SSCR_OFFSET               ((uint32_t)0x00000001U)  /* bit offset of SSCR */
#define SDRSCTL_SDSC_OFFSET               ((uint32_t)0x00000004U)  /* bit offset of SDSC */

/* EXMC_SDSTAT register bit offset */
#define SDSTAT_STA0_OFFSET                ((uint32_t)0x00000001U)  /* bit offset of STA0 */
#define SDSTAT_STA1_OFFSET                ((uint32_t)0x00000003U)  /* bit offset of STA1 */

