RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_exmc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(exmc_sdram_init_struct)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(exmc_sdram_init_struct->timing)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_POINTER);
    } else if(NOT_EXMC_SDRAM_DEVICE(exmc_sdram_init_struct->sdram_device)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_PIPELINE_DELAY(exmc_sdram_init_struct->pipeline_read_delay)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_ENABLE_DISABLE(exmc_sdram_init_struct->burst_read_switch)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDCLK(exmc_sdram_init_struct->sdclock_config)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_ENABLE_DISABLE(exmc_sdram_init_struct->write_protection)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_CAS_LATENCY(exmc_sdram_init_struct->cas_latency)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_INTER_BANK(exmc_sdram_init_struct->internal_bank_number)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_DATABUS_WIDTH(exmc_sdram_init_struct->data_width)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_ROW_ADDRESS(exmc_sdram_init_struct->row_address_width)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_COW_ADDRESS(exmc_sdram_init_struct->column_address_width)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_INVALID);
    } else if((exmc_sdram_init_struct->timing->row_to_column_delay < 1U) || (exmc_sdram_init_struct->timing->row_to_column_delay > 16U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_OUT_OF_RANGE);
    } else if((exmc_sdram_init_struct->timing->row_precharge_delay < 1U) || (exmc_sdram_init_struct->timing->row_precharge_delay > 16U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_OUT_OF_RANGE);
    } else if((exmc_sdram_init_struct->timing->write_recovery_delay < 1U) || (exmc_sdram_init_struct->timing->write_recovery_delay > 16U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_OUT_OF_RANGE);
    } else if((exmc_sdram_init_struct->timing->auto_refresh_delay < 1U) || (exmc_sdram_init_struct->timing->auto_refresh_delay > 16U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_OUT_OF_RANGE);
    } else if((exmc_sdram_init_struct->timing->row_address_select_delay < 1U) || (exmc_sdram_init_struct->timing->row_address_select_delay > 16U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_OUT_OF_RANGE);
    } else if((exmc_sdram_init_struct->timing->exit_selfrefresh_delay < 1U) || (exmc_sdram_init_struct->timing->exit_selfrefresh_delay > 16U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_OUT_OF_RANGE);
    } else if((exmc_sdram_init_struct->timing->load_mode_register_delay < 1U) || (exmc_sdram_init_struct->timing->load_mode_register_delay > 16U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(9), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure EXMC_SDCTL0 or EXMC_SDCTL1 */
        if(EXMC_SDRAM_DEVICE0 == exmc_sdram_init_struct->sdram_device) {
            /* configure EXMC_SDCTL0 */
            EXMC_SDCTL(EXMC_SDRAM_DEVICE0)  = (uint32_t)(exmc_sdram_init_struct->column_address_width |
                                              exmc_sdram_init_struct->row_address_width |
                                              exmc_sdram_init_struct->data_width |
                                              exmc_sdram_init_struct->internal_bank_number |
                                              exmc_sdram_init_struct->cas_latency |
                                              (exmc_sdram_init_struct->write_protection << SDCTL_WPEN_OFFSET) |
                                              exmc_sdram_init_struct->sdclock_config |
                                              (exmc_sdram_init_struct->burst_read_switch << SDCTL_BRSTRD_OFFSET) |
                                              exmc_sdram_init_struct->pipeline_read_delay);

            /* configure EXMC_SDTCFG0 */
            EXMC_SDTCFG(EXMC_SDRAM_DEVICE0) = (uint32_t)((exmc_sdram_init_struct->timing->load_mode_register_delay) - 1U) |
                                              (((exmc_sdram_init_struct->timing->exit_selfrefresh_delay) - 1U) << SDTCFG_XSRD_OFFSET) |
                                              (((exmc_sdram_init_struct->timing->row_address_select_delay) - 1U) << SDTCFG_RASD_OFFSET) |
                                              (((exmc_sdram_init_struct->timing->auto_refresh_delay) - 1U) << SDTCFG_ARFD_OFFSET) |
                                              (((exmc_sdram_init_struct->timing->write_recovery_delay) - 1U) << SDTCFG_WRD_OFFSET) |
                                              (((exmc_sdram_init_struct->timing->row_precharge_delay) - 1U) << SDTCFG_RPD_OFFSET) |
                                              (((exmc_sdram_init_struct->timing->row_to_column_delay) - 1U) << SDTCFG_RCD_OFFSET);
        } else {
            /* configure EXMC_SDCTL0 and EXMC_SDCTL1 */
            /* some bits in the EXMC_SDCTL1 register are reserved */
            sdctl0 = EXMC_SDCTL(EXMC_SDRAM_DEVICE0) & (~(EXMC_SDCTL_PIPED | EXMC_SDCTL_BRSTRD | EXMC_SDCTL_SDCLK | EXMC_SDCTL_SDCLK_2));

            sdctl0 |= (uint32_t)(exmc_sdram_init_struct->sdclock_config |
                                 (exmc_sdram_init_struct->burst_read_switch << SDCTL_BRSTRD_OFFSET) |
                                 exmc_sdram_init_struct->pipeline_read_delay);

