RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_exmc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_SDRAM_DELAY_CELL(delay_cell)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(14), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_READSAMPLE(extra_clk)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(14), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* reset the bits */
        sdrsctl = EXMC_SDRSCTL & (~(EXMC_SDRSCTL_SDSC | EXMC_SDRSCTL_SSCR));
        /* set the bits */
        sdrsctl |= (uint32_t)(delay_cell | extra_clk);
        EXMC_SDRSCTL = sdrsctl;
    }
}

/*!
    \brief      configure the SDRAM memory command
    \param[in]  exmc_sdram_command_init_struct: initialize EXMC SDRAM command
                  mode_register_content:
                  auto_refresh_number: EXMC_SDRAM_AUTO_REFLESH_x_SDCLK, x=1~15
                  bank_select: EXMC_SDRAM_DEVICE0_SELECT, EXMC_SDRAM_DEVICE1_SELECT
                  command: EXMC_SDRAM_NORMAL_OPERATION, EXMC_SDRAM_CLOCK_ENABLE, EXMC_SDRAM_PRECHARGE_ALL,
                           EXMC_SDRAM_AUTO_REFRESH, EXMC_SDRAM_LOAD_MODE_REGISTER, EXMC_SDRAM_SELF_REFRESH,
                           EXMC_SDRAM_POWERDOWN_ENTRY
    \param[out] none
    \retval     none
*/
void exmc_sdram_command_config(exmc_sdram_command_parameter_struct *exmc_sdram_command_init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(exmc_sdram_command_init_struct)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(15), ERR_PARAM_POINTER);
    } else if(NOT_EXMC_SDRAM_AUTO_REFLESH(exmc_sdram_command_init_struct->auto_refresh_number)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(15), ERR_PARAM_INVALID);
    } else if((exmc_sdram_command_init_struct->mode_register_content) > 0x1FFFU) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(15), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_EXMC_SDRAM_DEVICE_SELECT(exmc_sdram_command_init_struct->bank_select)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(15), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_SDRAM_COMMAND(exmc_sdram_command_init_struct->command)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(15), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure command register */
        EXMC_SDCMD = (uint32_t)((exmc_sdram_command_init_struct->command) |
                                (exmc_sdram_command_init_struct->bank_select) |
                                ((exmc_sdram_command_init_struct->auto_refresh_number)) |
                                ((exmc_sdram_command_init_struct->mode_register_content) << SDCMD_MRC_OFFSET));
    }
}

/*!
    \brief      set auto-refresh interval
    \param[in]  exmc_count: the number SDRAM clock cycles unit between two successive auto-refresh commands, 0x00000000~0x00001FFF
    \param[out] none
    \retval     none
*/
void exmc_sdram_refresh_count_set(uint32_t exmc_count)
{
    uint32_t sdari;
#ifdef FW_DEBUG_ERR_REPORT
    if((exmc_count > 0x1FFFU)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(16), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        sdari = EXMC_SDARI & (~EXMC_SDARI_ARINTV);
        EXMC_SDARI = sdari | (uint32_t)((exmc_count << SDARI_ARINTV_OFFSET) & EXMC_SDARI_ARINTV);
    }
}

/*!
    \brief      set the number of successive auto-refresh command
    \param[in]  exmc_number: the number of successive Auto-refresh cycles will be send, 1~15
    \param[out] none
    \retval     none
*/
void exmc_sdram_autorefresh_number_set(uint32_t exmc_number)
{
    uint32_t sdcmd;
#ifdef FW_DEBUG_ERR_REPORT
    if((exmc_number < 1U) || (exmc_number > 15U)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(17), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        sdcmd = EXMC_SDCMD & (~EXMC_SDCMD_NARF);
        EXMC_SDCMD = sdcmd | (uint32_t)((exmc_number << SDCMD_NARF_OFFSET) & EXMC_SDCMD_NARF);
    }
}

/*!
    \brief      configure the write protection function
    \param[in]  exmc_sdram_device: specify the SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_SDRAM_DEVICEx(x=0,1)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void exmc_sdram_write_protection_config(uint32_t exmc_sdram_device, ControlStatus newvalue)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_SDRAM_DEVICE(exmc_sdram_device)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(18), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_ENABLE_DISABLE(newvalue)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(18), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(ENABLE == newvalue) {
            EXMC_SDCTL(exmc_sdram_device) |= (uint32_t)EXMC_SDCTL_WPEN;
        } else {
            EXMC_SDCTL(exmc_sdram_device) &= ~((uint32_t)EXMC_SDCTL_WPEN);
        }
    }
}

/*!
    \brief      get the status of SDRAM device0 or device1
    \param[in]  exmc_sdram_device: specify the SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_SDRAM_DEVICEx(x=0,1)
    \param[out] none
    \retval     the status of SDRAM device
*/
uint32_t exmc_sdram_bankstatus_get(uint32_t exmc_sdram_device)
{
    uint32_t sdstat = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_SDRAM_DEVICE(exmc_sdram_device)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(19), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(EXMC_SDRAM_DEVICE0 == exmc_sdram_device) {
            sdstat = ((uint32_t)(EXMC_SDSTAT & EXMC_SDSDAT_STA0) >> SDSTAT_STA0_OFFSET);
        } else {
            sdstat = ((uint32_t)(EXMC_SDSTAT & EXMC_SDSDAT_STA1) >> SDSTAT_STA1_OFFSET);
        }
    }

    return sdstat;
}

/*!
    \brief      get EXMC flag status
    \param[in]  exmc_bank: specify the NAND bank or SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK2_NAND: the NAND bank2
      \arg        EXMC_SDRAM_DEVICE0: the SDRAM device0
      \arg        EXMC_SDRAM_DEVICE1: the SDRAM device1
    \param[in]  flag: EXMC status and flag
                only one parameter can be selected which is shown as below:
      \arg        EXMC_NAND_FLAG_LEVEL: interrupt high-level status
      \arg        EXMC_NAND_FLAG_RISE: interrupt rising edge status
      \arg        EXMC_NAND_FLAG_FALL: interrupt falling edge status
      \arg        EXMC_NAND_FLAG_FIFOE: FIFO empty flag
      \arg        EXMC_SDRAM_FLAG_REFRESH: refresh error interrupt flag
      \arg        EXMC_SDRAM_FLAG_NREADY: not ready status
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus exmc_flag_get(uint32_t exmc_bank, uint32_t flag)
{
    uint32_t status = 0x00000000U;
    FlagStatus temp_flag = RESET;

