RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_exmc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_BANK(exmc_bank)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(20), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_NAND_SDRAM_FLAG(flag)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(20), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(EXMC_BANK2_NAND == exmc_bank) {
            /* NAND bank2 */
            status = EXMC_NINTEN;
        } else {
            /* SDRAM device0 or device1 */
            status = EXMC_SDSTAT;
        }

        if((status & flag) != (uint32_t)flag) {
            /* flag is reset */
            temp_flag = RESET;
        } else {
            /* flag is set */
            temp_flag = SET;
        }
    }
    return temp_flag;
}

/*!
    \brief      clear EXMC flag status
    \param[in]  exmc_bank: specify the NAND bank or SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK2_NAND: the NAND bank2
      \arg        EXMC_SDRAM_DEVICE0: the SDRAM device0
      \arg        EXMC_SDRAM_DEVICE1: the SDRAM device1
    \param[in]  flag: EXMC status and flag
                only one parameter can be selected which is shown as below:
      \arg        EXMC_NAND_FLAG_LEVEL: interrupt high-level status
      \arg        EXMC_NAND_FLAG_RISE: interrupt rising edge status
      \arg        EXMC_NAND_FLAG_FALL: interrupt falling edge status
      \arg        EXMC_NAND_FLAG_FIFOE: FIFO empty flag
      \arg        EXMC_SDRAM_FLAG_REFRESH: refresh error interrupt flag
    \param[out] none
    \retval     none
*/
void exmc_flag_clear(uint32_t exmc_bank, uint32_t flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_BANK(exmc_bank)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(21), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_NAND_SDRAM_FLAG_CLR(flag)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(21), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(EXMC_BANK2_NAND == exmc_bank) {
            /* NAND bank2 */
            EXMC_NINTEN &= ~flag;
        } else {
            /* SDRAM device0 or device1 */
            EXMC_SDARI |= EXMC_SDARI_REC;
        }
    }
}

/*!
    \brief      enable EXMC interrupt
    \param[in]  exmc_bank: specify the NAND bank or SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK2_NAND: the NAND bank2
      \arg        EXMC_SDRAM_DEVICE0: the SDRAM device0
      \arg        EXMC_SDRAM_DEVICE1: the SDRAM device1
    \param[in]  interrupt: specify get which interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        EXMC_NAND_INT_LEVEL: high-level interrupt
      \arg        EXMC_NAND_INT_RISE: rising edge interrupt
      \arg        EXMC_NAND_INT_FALL: falling edge interrupt
      \arg        EXMC_SDRAM_INT_REFRESH: refresh error interrupt
    \param[out] none
    \retval     none
*/
void exmc_interrupt_enable(uint32_t exmc_bank, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_BANK(exmc_bank)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(22), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_NAND_SDRAM_INT(interrupt)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(22), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(EXMC_BANK2_NAND == exmc_bank) {
            /* NAND bank2 */
            EXMC_NINTEN |= interrupt;
        } else {
            /* SDRAM device0 or device1 */
            EXMC_SDARI |= EXMC_SDARI_REIE;
        }
    }
}

/*!
    \brief      disable EXMC interrupt
    \param[in]  exmc_bank: specify the NAND bank or SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK2_NAND: the NAND bank2
      \arg        EXMC_SDRAM_DEVICE0: the SDRAM device0
      \arg        EXMC_SDRAM_DEVICE1: the SDRAM device1
    \param[in]  interrupt: specify get which interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        EXMC_NAND_INT_LEVEL: high-level interrupt
      \arg        EXMC_NAND_INT_RISE: rising edge interrupt
      \arg        EXMC_NAND_INT_FALL: falling edge interrupt
      \arg        EXMC_SDRAM_INT_REFRESH: refresh error interrupt
    \param[out] none
    \retval     none
*/
void exmc_interrupt_disable(uint32_t exmc_bank, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_BANK(exmc_bank)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(23), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_NAND_SDRAM_INT(interrupt)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(23), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(EXMC_BANK2_NAND == exmc_bank) {
            /* NAND bank2 */
            EXMC_NINTEN &= ~interrupt;
        } else {
            /* SDRAM device0 or device1 */
            EXMC_SDARI &= ~EXMC_SDARI_REIE;
        }
    }
}

/*!
    \brief      get EXMC interrupt flag
    \param[in]  exmc_bank: specify the NAND bank or SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK2_NAND: the NAND bank2
      \arg        EXMC_SDRAM_DEVICE0: the SDRAM device0
      \arg        EXMC_SDRAM_DEVICE1: the SDRAM device1
    \param[in]  interrupt: EXMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        EXMC_NAND_INT_FLAG_LEVEL: high-level interrupt flag
      \arg        EXMC_NAND_INT_FLAG_RISE: rising edge interrupt flag
      \arg        EXMC_NAND_INT_FLAG_FALL: falling edge interrupt flag
      \arg        EXMC_SDRAM_INT_FLAG_REFRESH: refresh error interrupt and flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus exmc_interrupt_flag_get(uint32_t exmc_bank, uint32_t interrupt)
{
    uint32_t reg_value = 0x00000000U;
    uint32_t interrupt_enable = 0x00000000U;
    uint32_t interrupt_status = 0x00000000U;
    FlagStatus temp_flag = RESET;

