RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_exmc.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_BANK(exmc_bank)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(24), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_NAND_SDRAM_INT_FLAG(interrupt)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(24), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(EXMC_BANK2_NAND == exmc_bank) {
            /* NAND bank2 */
            reg_value = EXMC_NINTEN;
            interrupt_status = (reg_value & (interrupt >> NINTEN_INTEN_INTS_INTERVAL));
        } else {
            /* SDRAM device0 or device1 */
            reg_value = EXMC_SDARI;
            interrupt_status = (EXMC_SDSTAT & EXMC_SDSDAT_REIF);
        }

        interrupt_enable = (reg_value & interrupt);

        if((interrupt_enable) && (interrupt_status)) {
            /* interrupt flag is set */
            temp_flag = SET;
        } else {
            /* interrupt flag is reset */
            temp_flag = RESET;
        }
    }
    return temp_flag;
}

/*!
    \brief      clear EXMC interrupt flag
    \param[in]  exmc_bank: specify the NAND bank or SDRAM device
                only one parameter can be selected which is shown as below:
      \arg        EXMC_BANK2_NAND: the NAND bank2
      \arg        EXMC_SDRAM_DEVICE0: the SDRAM device0
      \arg        EXMC_SDRAM_DEVICE1: the SDRAM device1
    \param[in]  interrupt: EXMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        EXMC_NAND_INT_FLAG_LEVEL: high-level interrupt and flag
      \arg        EXMC_NAND_INT_FLAG_RISE: rising edge interrupt and flag
      \arg        EXMC_NAND_INT_FLAG_FALL: falling edge interrupt and flag
      \arg        EXMC_SDRAM_INT_FLAG_REFRESH: refresh error interrupt and flag
    \param[out] none
    \retval     none
*/
void exmc_interrupt_flag_clear(uint32_t exmc_bank, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_EXMC_BANK(exmc_bank)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(25), ERR_PARAM_INVALID);
    } else if(NOT_EXMC_NAND_SDRAM_INT_FLAG(interrupt)) {
        fw_debug_report_err(EXMC_MODULE_ID, API_ID(25), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(EXMC_BANK2_NAND == exmc_bank) {
            /* NAND bank2 */
            EXMC_NINTEN &= ~(interrupt >> NINTEN_INTEN_INTS_INTERVAL);
        } else {
            /* SDRAM device0 or device1 */
            EXMC_SDARI |= EXMC_SDARI_REC;
        }
    }
}
